Revit 2027 API
ParameterTypeId.CurveElemDefinesSlope Property
 "Defines Beam System Slope"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurveElemDefinesSlope { get; }
Public Shared ReadOnly Property CurveElemDefinesSlope As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurveElemDefinesSlope {
	ForgeTypeId^ get ();
}
static member CurveElemDefinesSlope : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace